XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/i2s_reg.h
    /* 0x8  reserved */
    uint8_t RESERVED0x8[8];

    /* 0x10 : i2s_bclk_config */
    union {
        struct {
            uint32_t cr_bclk_div_l  : 12; /* [11: 0],        r/w,        0x1 */
            uint32_t reserved_12_15 : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t cr_bclk_div_h  : 12; /* [27:16],        r/w,        0x1 */
            uint32_t reserved_28_31 : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } i2s_bclk_config;

    /* 0x14  reserved */
    uint8_t RESERVED0x14[108];

    /* 0x80 : i2s_fifo_config_0 */
    union {
        struct {
            uint32_t i2s_dma_tx_en     : 1;  /* [    0],        r/w,        0x0 */
            uint32_t i2s_dma_rx_en     : 1;  /* [    1],        r/w,        0x0 */
            uint32_t tx_fifo_clr       : 1;  /* [    2],        w1c,        0x0 */
            uint32_t rx_fifo_clr       : 1;  /* [    3],        w1c,        0x0 */
            uint32_t tx_fifo_overflow  : 1;  /* [    4],          r,        0x0 */
            uint32_t tx_fifo_underflow : 1;  /* [    5],          r,        0x0 */
            uint32_t rx_fifo_overflow  : 1;  /* [    6],          r,        0x0 */
            uint32_t rx_fifo_underflow : 1;  /* [    7],          r,        0x0 */
            uint32_t cr_fifo_lr_merge  : 1;  /* [    8],        r/w,        0x0 */
            uint32_t cr_fifo_lr_exchg  : 1;  /* [    9],        r/w,        0x0 */
            uint32_t cr_fifo_24b_lj    : 1;  /* [   10],        r/w,        0x0 */
            uint32_t reserved_11_31    : 21; /* [31:11],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } i2s_fifo_config_0;

    /* 0x84 : i2s_fifo_config_1 */
    union {
        struct {
            uint32_t tx_fifo_cnt    : 5; /* [ 4: 0],          r,       0x10 */
            uint32_t reserved_5_7   : 3; /* [ 7: 5],       rsvd,        0x0 */
            uint32_t rx_fifo_cnt    : 5; /* [12: 8],          r,        0x0 */
            uint32_t reserved_13_15 : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t tx_fifo_th     : 4; /* [19:16],        r/w,        0x0 */
            uint32_t reserved_20_23 : 4; /* [23:20],       rsvd,        0x0 */
            uint32_t rx_fifo_th     : 4; /* [27:24],        r/w,        0x0 */
            uint32_t reserved_28_31 : 4; /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } i2s_fifo_config_1;

    /* 0x88 : i2s_fifo_wdata */
    union {
        struct {
            uint32_t i2s_fifo_wdata : 32; /* [31: 0],          w,          x */
        } BF;
        uint32_t WORD;
    } i2s_fifo_wdata;

    /* 0x8C : i2s_fifo_rdata */
    union {
        struct {
            uint32_t i2s_fifo_rdata : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } i2s_fifo_rdata;

    /* 0x90  reserved */
    uint8_t RESERVED0x90[108];

    /* 0xFC : i2s_io_config */
    union {
        struct {
            uint32_t cr_i2s_txd_inv  : 1;  /* [    0],        r/w,        0x0 */
            uint32_t cr_i2s_rxd_inv  : 1;  /* [    1],        r/w,        0x0 */
            uint32_t cr_i2s_fs_inv   : 1;  /* [    2],        r/w,        0x0 */
            uint32_t cr_i2s_bclk_inv : 1;  /* [    3],        r/w,        0x0 */
            uint32_t cr_deg_cnt      : 3;  /* [ 6: 4],        r/w,        0x0 */
            uint32_t cr_deg_en       : 1;  /* [    7],        r/w,        0x0 */
            uint32_t reserved_8_31   : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } i2s_io_config;
};

typedef volatile struct i2s_reg i2s_reg_t;

#endif /* __I2S_REG_H__ */
